import numpy as np

joker = '�'

base = [joker, ' ']

numbers = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']

latin = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V',
         'W', 'X', 'Y', 'Z', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r',
         's', 't', 'u', 'v', 'w', 'x', 'y', 'z']

symbols = ['!', '¡', '?', '¿', ',', '—', '.', '·', ':', ';', '\\', '_', '&', '#', '@', '(', ')', '[', ']', '{', '}', '+',
           '-', '*', '/', '±', '=', '≠', '<', '>', '≤', '≥', 'ϵ', '∞', '%', '‰', '£', '€', '$', '§', '©', '®', '℥', "'",
           '‘', '’', '`', '„', '“', '"', '»', '«', '›', '‹', '☞', '☜', '^', '~', '°', '˛', '†', '|', '⁂', '⊥', '¬', '¤']

latin_special = ['À', 'Ą', 'Ⱥ', 'Ā', 'Å', 'Â', 'Ǡ', 'à', 'â', 'ã', 'ā', 'ą', 'ȧ', 'ⱥ', 'å', 'ă', 'ạ', 'ǎ', 'ȃ', 'ả', 'Ç',
                 'Ć', 'Ċ', 'ç', 'ć', 'ċ', 'ĉ', 'đ', 'È', 'Ę', 'Ɇ', 'Ê', 'Ë', 'è', 'ê', 'ë', 'ē', 'ę', 'ɇ', 'ẽ', 'ĕ', 'ė',
                 'ƒ', 'ġ', 'ǵ',  'Į', 'İ', 'Ì', 'Ï', 'ì', 'î', 'ï', 'ī', 'ı', 'ĭ', 'ǐ', 'ĩ', 'ḱ', 'Ł', 'Ľ', 'ĺ', 'ľ', 'ł',
                 'ḿ', 'ṁ', 'Ñ', 'ñ', 'ń', 'ṅ', 'ǹ', 'Ô', 'Ō', 'Ŏ', 'Ò', 'ò', 'ô', 'õ', 'ŏ', 'ō', 'ȍ', 'ő', 'ȯ', 'ọ', 'ø',
                 'ᵱ', 'ꝓ', 'ꝑ', 'ṗ', 'ṕ', 'ꝙ', 'ꝗ', 'Ŕ', 'ṙ', 'ŕ', 'Ş', 'Ś', 'Ș', 'ś', 'ṡ', 'ş', 'ŝ', 'Ù', 'ù', 'û', 'ũ',
                 'ū', 'ű', 'ŭ', 'ữ', 'ǔ', 'ꝟ', 'Ẃ', 'ẃ', 'ẇ', 'ẁ', 'ẉ', 'ÿ', 'ŷ', 'ỹ', 'ẏ', 'ȳ', 'ỳ', 'Ż', 'Ź', 'ź', 'ż',
                 'Æ', 'æ', 'Œ', 'œ', 'ə', 'ŋ', 'ʃ', 'ʒ', 'Ɛ']

czech_special = ['Á', 'Č', 'Ď', 'É', 'Ě', 'Í', 'Ň', 'Ó', 'Ř', 'Š', 'Ť', 'Ú', 'Ů', 'Ý', 'Ž',
                 'á', 'č', 'ď', 'é', 'ě', 'í', 'ň', 'ó', 'ř', 'š', 'ť', 'ú', 'ů', 'ý', 'ž']

german_special = ['Ä', 'Ö', 'Ü', 'ẞ', 'ä', 'ö', 'ü', 'ß', 'ſ', 'ꝛ']

russian = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф',
           'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я', 'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й',
           'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']

russian_special = ['Є', 'Ѕ', 'Ꙃ', 'Ꙁ', 'І', 'Ї', 'Ꙋ', 'Ѡ', 'Ѣ', 'Ꙗ', 'Ѥ', 'Ѫ', 'Ѭ', 'Ѧ', 'Ѩ', 'Ѯ', 'Ѱ', 'Ѳ', 'Ѵ',
                   'Ҁ', 'є', 'ѕ', 'ꙃ', 'ꙁ', 'і', 'ї', 'ꙋ', 'ѡ', 'ѣ', 'ꙗ', 'ѥ', 'ѫ', 'ѭ', 'ѧ', 'ѩ', 'ѯ', 'ѱ', 'ѳ',
                   'ѵ', 'ҁ', 'ӥ', 'Ұ', 'ј', 'њ', 'љ', 'ӣ', 'ѝ', 'ѓ', 'џ', 'ћ', 'ђ', 'ә', 'Ӕ', 'ӕ']


greek = ['Α', 'Β', 'Γ', 'Δ', 'Ε', 'Ζ', 'Η', 'Θ', 'Ι', 'Κ', 'Λ', 'Μ', 'Ν', 'Ξ', 'Ο', 'Π', 'Ρ', 'Σ', 'Ϲ', 'Τ', 'Υ', 'Φ',
         'Χ', 'Ψ', 'Ω', 'α', 'β', 'γ', 'δ', 'ε', 'ζ', 'η', 'θ', 'ι', 'κ', 'λ', 'μ', 'ν', 'ξ', 'ο', 'π', 'ρ', 'σ', 'ς',
         'ϲ', 'τ', 'υ', 'φ', 'χ', 'ψ', 'ω']

greek_special = ['ϳ', 'ϝ']

old_german_dta_umlaut = chr(868)
old_german_umlauted_chars = ['Aͤ', 'Oͤ', 'aͤ', 'eͤ', 'iͤ', 'oͤ', 'uͤ']

additional_characters = ['¶', old_german_dta_umlaut]

all = base + latin + symbols + numbers + czech_special + german_special + russian + russian_special + greek + \
      greek_special + latin_special + additional_characters

assert len(all) == len(set(all)), 'There are duplicit characters!'

all_with_padding = all + [chr(ord('􁀐') + i) for i in range(511-len(all))]

arabic = ['ا', 'ل', 'ي', 'م', 'و', 'ن', 'ر', 'ت', 'ع', 'ب', 'ه', 'د', 'ة', 'ف', 'ق', 'س', 'ك', 'ح', 'أ', 'ج', 'ش', 'خ',
          'ص', 'ط', 'ض', 'ذ', 'ى', '،', 'ز', 'ث', 'إ', 'ئ', 'ء', 'غ', 'ظ', 'ً', 'ؤ', 'ـ', '؟', 'آ', '؛', 'ّ', 'ُ', 'َ', 'ِ',
          'ٍ', 'ْ', 'ٌ']

madcat = base + latin + symbols + numbers + arabic


symbols_mapping = {'\t': ' ', '…': '...', '‥': '..', '⸗': '=', '–': '—', '‒': '—',  '­': '', '₤': '£', '×': 'x',
                   '‧': '·', '·': '·', '⋅': '·', '•': '·', '∙': '·', '−': '-', '∆': 'Δ', '⁎': '*', '¦': '|', '│': '|',
                   '℔': 'lb', '℞': 'R', '〃': '//',
                   'ˮ': '"', '‟': '"', '”': '"', 'ʺ': '"', '″': '"', '´': '’', 'ʼ': '’', '′': "'",  '´': '‘',
                   '⁋': '¶', '❡': '¶', '⸿': '¶', '‑': '-'}

fractions_mapping = {'¼': '1/4', '½': '1/2', '¾': '3/4', '⅐': '1/7', '⅑': '1/9', '⅒': '1/10', '⅓': '1/3', '⅔': '2/3',
                     '⅕': '1/5', '⅖': '2/5', '⅗': '3/5', '⅘': '4/5', '⅙': '1/6', '⅚': '5/6', '⅛': '1/8', '⅜': '3/8',
                     '⅝': '5/8', '⅞': '7/8', '⅟': '1/', '↉': '0/3'}

ligatures_mapping = {'': 'ſt', '': 'ſi', '': 'll', '': 'ſſ', 'ﬁ': 'fi', 'ĳ': 'ij', '': 'ct', 'ﬀ': 'ff', '': 'ſl',
                     'ﬂ': 'fl', '': 'ſſi', 'ﬃ': 'ffi', 'ﬆ': 'śt', 'Ĳ': 'IJ', 'ﬄ': 'ffl'}

index_mapping = {'⁰': '0', '¹': '1', '²': '2', '³': '3', '⁴': '4', '⁵': '5', '⁶': '6', '⁷': '7', '⁸': '8', '⁹': '9',
                 '₀': '0', '₁': '1', '₂': '2', '₃': '3', '₄': '4', '₅': '5', '₆': '6', '₇': '7', '₈': '8', '₉': '9'}

greek_mapping = {'ϑ': 'θ', 'ϖ': 'π', 'ϕ': 'φ', 'ϰ': 'κ', 'ϐ': 'β', 'µ': 'μ',
                 'ά': 'α', 'ἀ': 'α', 'ἄ': 'α', 'ὰ': 'α', 'ᾳ': 'α', 'ᾶ': 'α', 'ᾷ': 'α', 'ἅ': 'α', 'ᾱ': 'α', 'ἁ': 'α',
                 'ἆ': 'α',
                 'Ἀ': 'Α', 'Ἄ': 'Α', 'Ἅ': 'Α',
                 'ἐ': 'ε', 'έ': 'ε', 'ἔ': 'ε', 'ἑ': 'ε', 'ὲ': 'ε', 'ἕ': 'ε', 'ἓ': 'ε',
                 'Ἐ': 'Ε', 'Ἔ': 'Ε', 'Ἓ': 'Ε', 'Ἒ': 'Ε',
                 'ὸ': 'ο', 'ὁ': 'ο', 'ὀ': 'ο', 'ὅ': 'ο', 'ὄ': 'ο', 'ὃ': 'ο', 'Ὁ': 'Ο', 'ὂ': 'ο', 'ό': 'ο',
                 'ύ': 'υ', 'ῦ': 'υ', 'ὑ': 'υ', 'ὐ': 'υ', 'ὺ': 'υ', 'ὕ': 'υ', 'ὗ': 'υ', 'ὖ': 'υ', 'ὔ': 'υ',
                 'ῶ': 'ω', 'ῳ': 'ω', 'ῷ': 'ω', 'ὦ': 'ω', 'ὼ': 'ω', 'ὡ': 'ω', 'ὤ': 'ω', 'ὠ': 'ω', 'ὧ': 'ω', 'ᾧ': 'ω',
                 'ῴ': 'ω', 'ώ': 'ω',
                 'ὴ': 'η', 'ῆ': 'η', 'ἡ': 'η', 'ἦ': 'η', 'ῇ': 'η', 'ἠ': 'η', 'ῃ': 'η', 'ἧ': 'η', 'ἥ': 'η', 'ἤ': 'η',
                 'ἢ': 'η', 'ή': 'η',
                 'ϱ': 'ρ', 'ῥ': 'ρ', 'ῤ': 'ρ',
                 'ὶ': 'ι', 'ἰ': 'ι', 'ῖ': 'ι', 'ἱ': 'ι', 'ἴ': 'ι', 'ἶ': 'ι', 'ί': 'ι', 'ἷ': 'ι', 'ἵ': 'ι', 'ῒ': 'ι',
                 'ί': 'ι',
                 'Ὠ': 'Ω'}

roman_mapping = {'Ⅰ': 'I', 'Ⅴ': 'V', 'Ⅹ': 'X', 'Ⅼ': 'L', 'Ⅽ': 'C', 'Ⅾ': 'D', 'Ⅿ': 'M'}

# hebrew_mapping = {'ע': '', 'ב': '', 'כ': '', 'ר': '', 'ח': '', 'ש': '', 'ט': '', 'ג': '', 'נ': '', 'מ': '', 'ם': '',
#                   'פ': '', 'ס': '', 'אָ': '', 'ף': '', 'אַ': '', 'תּ': '', 'ז': '', 'ך': '', 'ק': '', 'ו': '', 'ד': '',
#                   'א': '', 'ל': '', 'ה': '', 'י': '', 'צ': '', 'ת': ''}

mapping = {**symbols_mapping, **fractions_mapping, **ligatures_mapping, **index_mapping, **greek_mapping,
           **roman_mapping}

character_set = {'all': all_with_padding, 'madcat': madcat}


def get_chars_mapping(transcriptions, chars=None, verbose=False):
    all_text = " ".join(transcriptions)
    all_chars = set(all_text) - {joker}
    if chars is None:
        chars = [joker] + sorted(list(all_chars))

    from_char = []
    to_char = []
    for i, c in enumerate(chars):
        from_char.append(c)
        to_char.append(chr(i))

    missing_chars = all_chars - set(chars)
    if verbose:
        print('MISSING', missing_chars)

    joker_position = chars.index(joker)
    for c in missing_chars:
        from_char.append(c)
        to_char.append(chr(joker_position))

    return from_char, to_char


def transcriptions_to_labels(from_char, to_char, transcriptions, chars_mapping=mapping):
    transcriptions = [''.join([chars_mapping[char] if char in chars_mapping else char for char in transcription])
                      for transcription in transcriptions]

    trans = str.maketrans(''.join(from_char), ''.join(to_char))
    labels = [np.asarray([ord(x) for x in l.translate(trans)], dtype=np.int32) for l in transcriptions]
    return labels


def missing_characters(charset, text):
    result = {}

    charset = set(charset)

    for char in text:
        if char not in charset:
            if char in mapping:
                missing_chars = missing_characters(charset, mapping[char])
            else:
                missing_chars = {char: 1}

            for missing_char in missing_chars:
                if missing_char in result:
                    result[missing_char] += missing_chars[missing_char]
                else:
                    result[missing_char] = missing_chars[missing_char]

    return result


dta_chars = [' ', '!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '.', '/', '0', '1', '2', '3', '4',
             '5', '6', '7', '8', '9', ':', ';', '<', '=', '>', '?', '@', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I',
             'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z', '[', ']', '_', 'a',
             'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v',
             'w', 'x', 'y', 'z', '|', '}', '~', '£', '§', '«', '¬', '°', '±', '¶', '·', '»', 'Ä', 'Å', 'Æ', 'Ç', 'È',
             'É', 'Ó', 'Ô', 'Ö', 'Ü', 'ß', 'à', 'á', 'â', 'ã', 'ä', 'å', 'æ', 'ç', 'è', 'é', 'ê', 'ë', 'ì', 'í', 'î',
             'ï', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', 'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'ÿ', 'Ā', 'ā', 'ă', 'ą', 'ć', 'Č', 'č',
             'ď', 'đ', 'ē', 'ĕ', 'ė', 'ę', 'ě', 'ī', 'ĭ', 'ı', 'ľ', 'ń', 'ň', 'ō', 'ŏ', 'œ', 'ř', 'ś', 'Š', 'š', 'ũ',
             'ū', 'ŭ', 'Ů', 'ů', 'ű', 'ŷ', 'ź', 'ż', 'Ž', 'ž', 'ſ', 'Ɛ', 'ǎ', 'ǵ', 'ə', 'ʒ', 'ͤ', 'Α', 'Γ', 'Δ', 'Ε',
             'Ζ', 'Η', 'Θ', 'Ι', 'Κ', 'Λ', 'Μ', 'Ν', 'Ξ', 'Ο', 'Π', 'Ρ', 'Σ', 'Τ', 'Υ', 'Φ', 'Χ', 'Ψ', 'Ω', 'α', 'β',
             'γ', 'δ', 'ε', 'ζ', 'η', 'θ', 'ι', 'κ', 'λ', 'μ', 'ν', 'ξ', 'ο', 'π', 'ρ', 'ς', 'σ', 'τ', 'υ', 'φ', 'χ',
             'ψ', 'ω', 'ϝ', 'ϲ', 'ϳ', 'ϵ', 'Б', 'Э', 'и', 'й', 'н', 'о', 'т', 'ш', 'ӕ', 'ᵱ', 'ḱ', 'ṁ', 'ṅ', 'ẽ', '—',
             '‘', '’', '“', '„', '†', '‰', '›', '⁂', '℥', '∞', '⊥', '☜', '☞', 'ꝑ', 'ꝓ', 'ꝗ', 'ꝙ', 'ꝛ', 'ꝟ']
